{"id":"1638846691-9438-1372332170","version":1,"type":"request","time":1638846691.672558,"method":"PATCH","url":"http:\/\/localhost:8000\/admin\/posts\/39","uri":"\/admin\/posts\/39","headers":{"host":["localhost:8000"],"connection":["keep-alive"],"content-length":["14501"],"cache-control":["max-age=0"],"upgrade-insecure-requests":["1"],"origin":["http:\/\/localhost:8000"],"content-type":["multipart\/form-data; boundary=----WebKitFormBoundarypC1HxO5uARzHDBq7"],"user-agent":["Mozilla\/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit\/537.36 (KHTML, like Gecko) Chrome\/96.0.4664.45 Safari\/537.36"],"accept":["text\/html,application\/xhtml+xml,application\/xml;q=0.9,image\/avif,image\/webp,image\/apng,*\/*;q=0.8,application\/signed-exchange;v=b3;q=0.9"],"sec-gpc":["1"],"sec-fetch-site":["same-origin"],"sec-fetch-mode":["navigate"],"sec-fetch-user":["?1"],"sec-fetch-dest":["document"],"referer":["http:\/\/localhost:8000\/admin\/posts\/39\/edit"],"accept-encoding":["gzip, deflate, br"],"accept-language":["en-US,en;q=0.9"],"cookie":["XDEBUG_PROFILE=; Phpstorm-46ee3656=c63c2971-00a4-42a5-85dd-240184da861a; XSRF-TOKEN=eyJpdiI6IitQbnJZWmFqNXIreGU1ejhqcTJNbkE9PSIsInZhbHVlIjoib0hlb25qb3RnK1VjelFpcmdvRkY0MVNraUN6Qks3ckhZc1VoTWJMdkZFbnlWQXNvVkd3aXR1NUExTk85QmVlZUlCYjhqRnltN0UvOHkwNllQcDVOcytLdVM2R0ZSSDlLWDQ1cWp2cDhQOUIzVjM3dnoxYXE0dldBNHZDZDQ0QTYiLCJtYWMiOiJjMjFkY2EzZGZiYzc2MjEwMTdmNzU5OTQ0MTk5ZWRhMDNiMjUzZjM0YTc2NDM0ZDgwMDQ4YjU3ZDY1NDRjZGE5IiwidGFnIjoiIn0%3D; laravel_session=eyJpdiI6Ik5LZm1qY0QvNWdEa3pVaEV3MUlTTmc9PSIsInZhbHVlIjoiRmFLTlhzalg1NWZmbHhDVDB3dTdFLzVjd1NoOEZVY0NkNi93LzZlVDRJa3I1OXVqUWVoemJ2N05HRVNNN2FsbXZYelljb1lTOTBCQ0dPR3lPSzUxRmxhTkVKMVlxcXQ1TG41TEl0QlZsN2JocjlWZFVwUUxRdmNjY2hyYUlDTjUiLCJtYWMiOiI0NmM1MDdhOTdjNTE5OTYzNDBiNWQ5MWEyZjAyNTk3NDllYWE0MjAyMGRlMTQ2ZGM2YTUyMDAzZTMyNjc4ZjdmIiwidGFnIjoiIn0%3D"]},"controller":"App\\Http\\Controllers\\AdminPostController@update","getData":[],"postData":{"_token":"cjql5zAGzFTwVWloW4NP1kikgGqBMQbdyjWIEEyh","_method":"PATCH","title":"Learning how to learn","slug":"learning-how-to-learn","excerpt":"Insights from the Coursera course - Learning How to Learn by Dr.Barbara Oakley and Dr.Terrence Sejnowski","category_id":"1","body":"*Insights from the Coursera course - Learning How to Learn by Dr.Barbara Oakley and Dr.Terrence Sejnowski*\r\n\r\nThis is part two of my key takeaways from the Learning How to Learn Coursera course. [Here's part one if you're interested in following along](https:\/\/steemit.com\/teammalaysia\/@arwinzen\/learning-how-to-learn-part-1). A warning to those who haven't watched the movie \"Click\" - fair amount of spoilers ahead. \r\n\r\n# Movie Analogy\r\nOne of my favourite illustrations of how habits can shape one's future comes from a brilliant concept from the movie \"Click\". In it, the protagonist (Michael Newman, played by Adam Sandler) is given a universal remote which allows him to control reality as how one would a TV; allowing him to pause, fast-forward, and rewind to recall past events. Michael realizes that by fast forwarding over the mundane and uncomfortable parts of life, he's able to skip ahead to the good parts, like getting a promotion. However, whenever he does this, his body stays in auto-pilot mode - similar to a zombie in some sense. \r\n\r\nFast-forwarding through showers, arguments, and even sex with his wife, he skips forward a year to his much awaited job promotion, but also finds his marriage in pieces. What he doesn't realize is that the universal remote has memorized his preferences, and starts skipping ahead in response to the usual triggers (whenever he gets into a fight with his wife for example). By the time he realizes this, his life is in complete shambles. \r\n\r\nYou may be asking: *\"how does this relate to procrastination\"*, but keep this little vignette in mind as we move through the article, and hopefully you'll see the connection. \r\n\r\n<center>\r\n\r\n![Picture of Adam Sandler from the movie \"Click\"](https:\/\/www.sportsauthenticsusa.com\/thumbnail.asp?file=https:\/\/i.ebayimg.com\/images\/g\/cMIAAOSwB09YJmhE\/s-l1600.jpg&maxx=300&maxy=0)\r\n[Image Source](https:\/\/www.sportsauthenticsusa.com\/thumbnail.asp?file=https:\/\/i.ebayimg.com\/images\/g\/cMIAAOSwB09YJmhE\/s-l1600.jpg&maxx=300&maxy=0)\r\n\r\n<\/center>\r\n\r\n# Habits, Procrastination, and Zombies? \r\nHabit is simply a tool that our brain uses to conserve energy, and is intricately linked to  chunks (neural patterns in our brains that are linked together through practice and repetition). When a habit has been ingrained in our minds, our brain goes into an almost mindless zombie state when executing a habitual routine. Often times, we're not even aware of everything that we're doing while in this state. \r\n\r\n![Interior of a classic car](https:\/\/images.unsplash.com\/photo-1481915545107-06c28ec37163?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=a53987b0cd051764b556ecbdd32006f3&auto=format&fit=crop&w=1950&q=80)\r\n\r\nThink back to the first time you started learning to drive a manual car. Initially it takes a concerted effort to be able to shift gears while holding down the clutch, and any distraction during these initial stages of learning would likely throw us off our focus. However, once we've mastered (chunked) gear shifting, it becomes a habitual routine that we can even execute while talking to a passenger, or for some even when they're not fully sober (gasp!). The point is that habits are beneficial for us to function, it helps us conserve energy, and frees our mind to process other bits of information, and we can be in zombie mode while executing habitual routines. \r\n\r\n> Procrastination is a single, monumentally important \"key-stone\" bad habit. [1]\r\n\r\n# Why do we procrastinate? \r\nSimply put, procrastination is always the easier option compared to the task at hand. Researchers have discovered that the pain centers in our brain light up when we're faced with a task that requires effort [2]. Our natural instinct is to avoid pain, and to instead seek out the pleasurable. Hence we shift our attention naturally to anything and everything in order to get rid of this discomfort. \r\n\r\nProcrastination is the perfect antidote to this pain, because it's the quickest and easiest route to enjoyment. This pattern when repeated many times over the course of several years can make this habit so ingrained, that it may feel impossible to beat. Some may even feel that procrastination is part of their identity which can't be rid off. \r\n\r\nIn this respect, procrastination is not dissimilar to addiction. It promises a reward of pleasure without the cost of hard work. Compare the man who resorts to alcohol instead of dealing with a conflict at home to the person who puts off studying with surfing aimlessly through the internet. \r\n\r\nOur brain works a lot like the universal remote from \"Click\", it remembers our preferences everytime we choose the easy way out. Neural patterns are strengthened each time we repeat an addictive routine. Over time, addicts often profess that they feel like they have no control over their actions. Recent discovery has shown however that the brain has the ability to change, also known as neuroplasticity [3]. So there is hope!\r\n\r\n# Dissecting Habits\r\nIn order to combat procrastination, we need to understand the four different components that make up a habit:\r\n\r\n**The Cue**:The trigger that sets us off on our mindless zombie like routines. The cue in itself isn't inherently good or bad, but it's our routine response that is important. \r\n\r\n**The Routine**: Enter the zombie mode. This is our habitual response that we resort to when receiving a particular cue. Can be harnessed as a useful tool, or a destructive force. \r\n\r\n**The Reward**: The engine that fuels the habit. Habits work because of the promise of a reward - delectable servings of pleasure. As much as procrastination gives us a temporary sense of pleasure, good habits reward us in ways that are arguably more concrete. The role of reward is an important one in rewiring our brain to combat procrastination. \r\n\r\n**The Belief**: At the root of a habit is the underlying belief. This needs to be changed before we try and combat procrastination. A common belief is that procrastination is part of who I am as a person.\r\n\r\n# Resolving the Analogy\r\nNow back to the \"Click\" analogy - hopefully you've noticed the similarities by now, but if not, here's how I looked at things: \r\n\r\n**The Cue** : In the movie, Michael wants to skip over feelings of inadequacy (financially), and uncomfortable situations (arguments with his wife). This is his trigger. \r\n\r\n**The Routine** : He simply fast forwards these uncomfortable parts in order to not have to deal with them. However when he skips forward, his body still participates in all the events, but mostly as a mindless zombie with limited responses. Repetition causes the remote to remember his preferences as to when to skip ahead, and the next time a trigger arises, the remote simply hits skip. Similarly, once a habit has been ingrained, we carry out the steps in an almost zombie like manner. \r\n\r\n\r\n> Michael Newman : I'm freakin' out. This thing - this thing - it's broken. It-it's just -it's fast forwarding on its own now.\r\n>\r\n> Morty : It's not a malfunction it's a feature. It's using it's memory to execute your preferences.\r\n<br>\r\n\r\n**The Reward** : Michael wants to skip ahead to the big promotion without the hassle of having to work for another year. In the same way, we want instant gratification without the required effort that comes with it. When he finally skips ahead to the promotion, he realizes that he has destroyed the lives of those he loves. Similarly, we can potentially destroy the lives of those we love in pursuit of instant gratification. \r\n\r\n**The Belief** : Ultimately Michael believed that the promotion would make him a better husband and a dad because it would mean being able to provide a better life. However when he's offered a second chance at the end of the show, he realizes that the best life he can give them is to be present with them, and to give his family quality time instead of quality presents. \r\n\r\nAlthough slightly unnecessary, I hope that analogy made sense (and was somewhat fun)! \r\n\r\n# Combating Procrastination\r\nWith this insight into how habits work, how do we actually fight procrastination? Here are some methods that are based off how habits function:\r\n\r\n## 1. Process over Product\r\nFocusing on the end product is what causes the pain centers in our brain to light up, which in turn leads us to procrastinate. This is because getting to the end product often feels like an impossible climb, especially when we're staring at it from the bottom. \r\n\r\n<center>\r\n\r\n![El capistan wall in Yosemite Park](https:\/\/www.atlasandboots.com\/wp-content\/uploads\/2016\/03\/big-wall-el-capitan.jpg)\r\n[Image Source](https:\/\/www.atlasandboots.com\/wp-content\/uploads\/2016\/03\/big-wall-el-capitan.jpg)\r\n\r\n<\/center>\r\n\r\nA helpful trick is to **stop focusing on product**, and instead **shift our focus to the process**. For example, instead of trying to finish an essay in one sitting, commit to spending an hour a day regardless of how fast or slow the progress may seem. This of course requires us to start a lot earlier, but that's the whole point of this practice. The underlying idea here is that the habitual part of the brain (the zombies) enjoys processes more than product because it can march on aimlessly. \r\n\r\nA useful tool to facilitate this process oriented approach is to use the *pomodoro* technique. This is basically using a timer to breaks down tasks into smaller, more manageable 25 minute sessions. Once the time is up, it is important to reward yourself with a little break. Try not to use the pomodoro as a hard and fast rule for all tasks, but merely a tool that adapts with the task at hand. For example, some tasks require more than 25 minutes in order to get into a working rhythm. Feel free to even move away from the pomodoro every now and then, but if you find yourself starting to procrastinate then switch back. There are plenty of time management apps for the PC and mobile that include a pomodoro setting. I've personally been using [Toggl](https:\/\/toggl.com\/) which has a handy Chrome extension for quick access. \r\n\r\n## 2. Rewiring the Brain\r\nReward lies at the heart of the habit. In order to overcome bad habits, we can make use of rewards. Think about what you can use to substitute in place of the pleasure that procrastination brings. This can be anything that you enjoy doing - playing with your dog, having a glass of whiskey \/ chocolate, or perhaps going out to watch a movie. Incorporate these rewards in proportion to the task that has just been accomplished. Once your brain starts expecting these rewards, the rewiring process has already begun. \r\n\r\n<center>\r\n\r\n![Picture of my toy poodle \"Hazel\"](https:\/\/lh3.googleusercontent.com\/Zfeo-0ySdPoAXUVEH9dxcW2ZvMdULAx7ZZFQacUU9GuuoICo8f-CeMeIVRO4Vs2L9rMdpQVwyIYQ33ojsPG8xltAjTerkAFrtuIoeCkLsJgkEduYF7KS5gtArvyaWbgn2y9Lo20112A=w2400)\r\nPaint me like one of your french girls\r\n\r\n<\/center>\r\n\r\nNeurogical cravings are driven by the neurotransmitter called dopamine, which is released in the brain in anticipation of a desired outcome [4]. Dopamine is closely tied to motivation in human beings. Once the brain learns that a particular routine is going to end up with a reward, higher levels of dopamine are released, which motivates us through that difficult task. Over time this can even make these dreaded study sessions enjoyable. \r\n\r\n## 3. Lists and Eating Frogs? \r\nI'll conclude with a few more techniques from the course that I've found useful in practice: \r\n* Making a list of weekly & daily goals - Write down a list of important tasks for the week. Before heading to bed, list down daily goals for the next day. This lets your brain work subconsciously on how to approach the next day's tasks throughout your sleep. \r\n\r\n(*I use the [bullet journal](https:\/\/bulletjournal.com\/) system to do this*)\r\n\r\n* Make sure to include a quitting time - Important to set a quitting time as we need both diffused and focused modes to work in tandem. It also gives your mind an end point to look forward to in the day. \r\n* Eat your frogs first thing in the morning - Work on the most important, and most disliked task first thing in the morning. Enlist the pomodoro to help. \r\n \r\n<center>\r\n![Picture of a frog in a person's grip](https:\/\/images.unsplash.com\/photo-1510080804907-2ae1358f192d?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=fce87b7856eea1edd0ac77c97b31af77&auto=format&fit=crop&w=1951&q=80)\r\n[Image Source](https:\/\/images.unsplash.com\/photo-1510080804907-2ae1358f192d?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=fce87b7856eea1edd0ac77c97b31af77&auto=format&fit=crop&w=1951&q=80)\r\n<\/center>\r\n\r\n# Wrap up \r\n There's a lot more that I left out for the sake of brevity, so please do check [Dr. Barbara Oakley](https:\/\/barbaraoakley.com\/) out if you're interested in learning more. I hope that these articles provide a basic understanding into the learning process, how habits work, and equip you with a few techniques to aid in the fight against procrastination. \r\n\r\n# References\r\n[1] B. Oakley, A mind for numbers. New York: Jeremy P. Tarcher\/Penguin, 2014.\r\n[2] I. Lyons and S. Beilock, \"When Math Hurts: Math Anxiety Predicts Pain Network Activation in Anticipation of Doing Math\", PLoS ONE, vol. 7, no. 10, p. e48076, 2012.\r\n[3] B. Driss, \"Neuroplasticity and learning\", Frontiers in Neuroscience, vol. 4, 2010.\r\n[4] K. Berridge and T. Robinson, \"What is the role of dopamine in reward: hedonic impact, reward learning, or incentive salience?\", Brain Research Reviews, vol. 28, no. 3, pp. 309-369, 1998."},"requestData":null,"sessionData":{"_token":"cjql5zAGzFTwVWloW4NP1kikgGqBMQbdyjWIEEyh","_previous":{"__type__":"array","url":"http:\/\/localhost:8000\/admin\/posts\/39\/edit"},"_flash":{"__type__":"array","old":{"__type__":"array","0":"success"},"new":{"__type__":"array"}},"login_web_59ba36addc2b2f9401580f014c7f58ea4e30989d":1,"success":"Post successfully updated."},"authenticatedUser":{"id":1,"username":"arwin@mail.com","email":"arwin@mail.com","name":"Arwin Goo"},"cookies":{"XDEBUG_PROFILE":"","Phpstorm-46ee3656":"c63c2971-00a4-42a5-85dd-240184da861a","XSRF-TOKEN":"eyJpdiI6IitQbnJZWmFqNXIreGU1ejhqcTJNbkE9PSIsInZhbHVlIjoib0hlb25qb3RnK1VjelFpcmdvRkY0MVNraUN6Qks3ckhZc1VoTWJMdkZFbnlWQXNvVkd3aXR1NUExTk85QmVlZUlCYjhqRnltN0UvOHkwNllQcDVOcytLdVM2R0ZSSDlLWDQ1cWp2cDhQOUIzVjM3dnoxYXE0dldBNHZDZDQ0QTYiLCJtYWMiOiJjMjFkY2EzZGZiYzc2MjEwMTdmNzU5OTQ0MTk5ZWRhMDNiMjUzZjM0YTc2NDM0ZDgwMDQ4YjU3ZDY1NDRjZGE5IiwidGFnIjoiIn0=","laravel_session":"eyJpdiI6Ik5LZm1qY0QvNWdEa3pVaEV3MUlTTmc9PSIsInZhbHVlIjoiRmFLTlhzalg1NWZmbHhDVDB3dTdFLzVjd1NoOEZVY0NkNi93LzZlVDRJa3I1OXVqUWVoemJ2N05HRVNNN2FsbXZYelljb1lTOTBCQ0dPR3lPSzUxRmxhTkVKMVlxcXQ1TG41TEl0QlZsN2JocjlWZFVwUUxRdmNjY2hyYUlDTjUiLCJtYWMiOiI0NmM1MDdhOTdjNTE5OTYzNDBiNWQ5MWEyZjAyNTk3NDllYWE0MjAyMGRlMTQ2ZGM2YTUyMDAzZTMyNjc4ZjdmIiwidGFnIjoiIn0="},"responseTime":1638846692.342432,"responseStatus":302,"responseDuration":669.8739528656006,"memoryUsage":20971520,"middleware":["web","can:admin"],"databaseQueries":[{"query":"SELECT * FROM `posts` WHERE `id` = '39' LIMIT 1","duration":32.19,"connection":"mysql","time":1638846692.2195768,"trace":[{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\fruitcake\\laravel-cors\\src\\HandleCors.php","line":38,"isVendor":true},{"call":"Fruitcake\\Cors\\HandleCors->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Http\\Middleware\\TrustProxies.php","line":39,"isVendor":true},{"call":"Illuminate\\Http\\Middleware\\TrustProxies->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\itsgoingd\\clockwork\\Clockwork\\Support\\Laravel\\ClockworkMiddleware.php","line":24,"isVendor":true},{"call":"Clockwork\\Support\\Laravel\\ClockworkMiddleware->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":103,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->then()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Foundation\\Http\\Kernel.php","line":142,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->sendRequestThroughRouter()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Foundation\\Http\\Kernel.php","line":111,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->handle()","file":"C:\\xampp\\htdocs\\blog\\public\\index.php","line":52,"isVendor":false}],"model":"App\\Models\\Post","tags":[]},{"query":"SELECT * FROM `categories` WHERE `categories`.`id` in (1)","duration":1,"connection":"mysql","time":1638846692.260821,"trace":[{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\fruitcake\\laravel-cors\\src\\HandleCors.php","line":38,"isVendor":true},{"call":"Fruitcake\\Cors\\HandleCors->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Http\\Middleware\\TrustProxies.php","line":39,"isVendor":true},{"call":"Illuminate\\Http\\Middleware\\TrustProxies->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\itsgoingd\\clockwork\\Clockwork\\Support\\Laravel\\ClockworkMiddleware.php","line":24,"isVendor":true},{"call":"Clockwork\\Support\\Laravel\\ClockworkMiddleware->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":103,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->then()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Foundation\\Http\\Kernel.php","line":142,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->sendRequestThroughRouter()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Foundation\\Http\\Kernel.php","line":111,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->handle()","file":"C:\\xampp\\htdocs\\blog\\public\\index.php","line":52,"isVendor":false}],"model":"App\\Models\\Category","tags":[]},{"query":"SELECT * FROM `users` WHERE `users`.`id` in (1)","duration":1.01,"connection":"mysql","time":1638846692.2692091,"trace":[{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\fruitcake\\laravel-cors\\src\\HandleCors.php","line":38,"isVendor":true},{"call":"Fruitcake\\Cors\\HandleCors->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Http\\Middleware\\TrustProxies.php","line":39,"isVendor":true},{"call":"Illuminate\\Http\\Middleware\\TrustProxies->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\itsgoingd\\clockwork\\Clockwork\\Support\\Laravel\\ClockworkMiddleware.php","line":24,"isVendor":true},{"call":"Clockwork\\Support\\Laravel\\ClockworkMiddleware->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":103,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->then()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Foundation\\Http\\Kernel.php","line":142,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->sendRequestThroughRouter()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Foundation\\Http\\Kernel.php","line":111,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->handle()","file":"C:\\xampp\\htdocs\\blog\\public\\index.php","line":52,"isVendor":false}],"model":"App\\Models\\User","tags":[]},{"query":"SELECT * FROM `users` WHERE `id` = 1 LIMIT 1","duration":1.49,"connection":"mysql","time":1638846692.280074,"trace":[{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\fruitcake\\laravel-cors\\src\\HandleCors.php","line":38,"isVendor":true},{"call":"Fruitcake\\Cors\\HandleCors->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Http\\Middleware\\TrustProxies.php","line":39,"isVendor":true},{"call":"Illuminate\\Http\\Middleware\\TrustProxies->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\itsgoingd\\clockwork\\Clockwork\\Support\\Laravel\\ClockworkMiddleware.php","line":24,"isVendor":true},{"call":"Clockwork\\Support\\Laravel\\ClockworkMiddleware->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":103,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->then()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Foundation\\Http\\Kernel.php","line":142,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->sendRequestThroughRouter()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Foundation\\Http\\Kernel.php","line":111,"isVendor":true},{"call":"Illuminate\\Foundation\\Http\\Kernel->handle()","file":"C:\\xampp\\htdocs\\blog\\public\\index.php","line":52,"isVendor":false}],"model":"App\\Models\\User","tags":[]},{"query":"SELECT count(*) as aggregate FROM `posts` WHERE `slug` = 'learning-how-to-learn' and `id` <> '39'","duration":1.9,"connection":"mysql","time":1638846692.308626,"trace":[{"call":"Illuminate\\Http\\Request->__call()","file":"C:\\xampp\\htdocs\\blog\\app\\Http\\Controllers\\AdminPostController.php","line":62,"isVendor":false},{"call":"App\\Http\\Controllers\\AdminPostController->update()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Router.php","line":695,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Auth\\Middleware\\Authorize.php","line":45,"isVendor":true},{"call":"Illuminate\\Auth\\Middleware\\Authorize->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Middleware\\SubstituteBindings.php","line":50,"isVendor":true}],"model":null,"tags":[]},{"query":"SELECT count(*) as aggregate FROM `categories` WHERE `id` = '1'","duration":1.08,"connection":"mysql","time":1638846692.311915,"trace":[{"call":"Illuminate\\Http\\Request->__call()","file":"C:\\xampp\\htdocs\\blog\\app\\Http\\Controllers\\AdminPostController.php","line":62,"isVendor":false},{"call":"App\\Http\\Controllers\\AdminPostController->update()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Router.php","line":695,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Auth\\Middleware\\Authorize.php","line":45,"isVendor":true},{"call":"Illuminate\\Auth\\Middleware\\Authorize->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Middleware\\SubstituteBindings.php","line":50,"isVendor":true}],"model":null,"tags":[]},{"query":"UPDATE `posts` SET `body` = '*Insights FROM the Coursera course - Learning How to Learn by Dr.Barbara Oakley and Dr.Terrence Sejnowski*\\\\r\\\\n\\\\r\\\\nThis IS part two of my key takeaways FROM the Learning How to Learn Coursera course. [Here\\\\'s part one if you\\\\'re interested in following along](https:\/\/steemit.com\/teammalaysia\/@arwinzen\/learning-how-to-learn-part-1). A warning to those who haven\\\\'t watched the movie \\\\\"Click\\\\\" - fair amount of spoilers ahead. \\\\r\\\\n\\\\r\\\\n# Movie Analogy\\\\r\\\\nOne of my favourite illustrations of how habits can shape one\\\\'s future comes FROM a brilliant concept FROM the movie \\\\\"Click\\\\\". In it, the protagonist (Michael Newman, played by Adam Sandler) IS given a universal remote which allows him to control reality as how one would a TV; allowing him to pause, fast-forward, and rewind to recall past events. Michael realizes that by fast forwarding over the mundane and uncomfortable parts of life, he\\\\'s able to skip ahead to the good parts, like getting a promotion. However, whenever he does this, his body stays in auto-pilot mode - similar to a zombie in some sense. \\\\r\\\\n\\\\r\\\\nFast-forwarding through showers, arguments, and even sex with his wife, he skips forward a year to his much awaited job promotion, but also finds his marriage in pieces. What he doesn\\\\'t realize IS that the universal remote has memorized his preferences, and starts skipping ahead in response to the usual triggers (whenever he gets INTO a fight with his wife for example). By the time he realizes this, his life IS in complete shambles. \\\\r\\\\n\\\\r\\\\nYou may be asking: *\\\\\"how does this relate to procrastination\\\\\"*, but keep this little vignette in mind as we move through the article, and hopefully you\\\\'ll see the connection. \\\\r\\\\n\\\\r\\\\n<center>\\\\r\\\\n\\\\r\\\\n![Picture of Adam Sandler FROM the movie \\\\\"Click\\\\\"](https:\/\/www.sportsauthenticsusa.com\/thumbnail.asp?file=https:\/\/i.ebayimg.com\/images\/g\/cMIAAOSwB09YJmhE\/s-l1600.jpg&maxx=300&maxy=0)\\\\r\\\\n[Image Source](https:\/\/www.sportsauthenticsusa.com\/thumbnail.asp?file=https:\/\/i.ebayimg.com\/images\/g\/cMIAAOSwB09YJmhE\/s-l1600.jpg&maxx=300&maxy=0)\\\\r\\\\n\\\\r\\\\n<\/center>\\\\r\\\\n\\\\r\\\\n# Habits, Procrastination, and Zombies? \\\\r\\\\nHabit IS simply a tool that our brain uses to conserve energy, and IS intricately linked to  chunks (neural patterns in our brains that are linked together through practice and repetition). When a habit has been ingrained in our minds, our brain goes INTO an almost mindless zombie state when executing a habitual routine. Often times, we\\\\'re not even aware of everything that we\\\\'re doing while in this state. \\\\r\\\\n\\\\r\\\\n![Interior of a classic car](https:\/\/images.unsplash.com\/photo-1481915545107-06c28ec37163?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=a53987b0cd051764b556ecbdd32006f3&auto=format&fit=crop&w=1950&q=80)\\\\r\\\\n\\\\r\\\\nThink back to the first time you started learning to drive a manual car. Initially it takes a concerted effort to be able to shift gears while holding down the clutch, and any distraction during these initial stages of learning would likely throw us off our focus. However, once we\\\\'ve mastered (chunked) gear shifting, it becomes a habitual routine that we can even execute while talking to a passenger, or for some even when they\\\\'re not fully sober (gasp!). The point IS that habits are beneficial for us to function, it helps us conserve energy, and frees our mind to process other bits of information, and we can be in zombie mode while executing habitual routines. \\\\r\\\\n\\\\r\\\\n> Procrastination IS a single, monumentally important \\\\\"key-stone\\\\\" bad habit. [1]\\\\r\\\\n\\\\r\\\\n# Why do we procrastinate? \\\\r\\\\nSimply put, procrastination IS always the easier option compared to the task at hand. Researchers have discovered that the pain centers in our brain light up when we\\\\'re faced with a task that requires effort [2]. Our natural instinct IS to avoid pain, and to instead seek out the pleasurable. Hence we shift our attention naturally to anything and everything in order to get rid of this discomfort. \\\\r\\\\n\\\\r\\\\nProcrastination IS the perfect antidote to this pain, because it\\\\'s the quickest and easiest route to enjoyment. This pattern when repeated many times over the course of several years can make this habit so ingrained, that it may feel impossible to beat. Some may even feel that procrastination IS part of their identity which can\\\\'t be rid off. \\\\r\\\\n\\\\r\\\\nIn this respect, procrastination IS not dissimilar to addiction. It promises a reward of pleasure without the cost of hard work. Compare the man who resorts to alcohol instead of dealing with a conflict at home to the person who puts off studying with surfing aimlessly through the internet. \\\\r\\\\n\\\\r\\\\nOur brain works a lot like the universal remote FROM \\\\\"Click\\\\\", it remembers our preferences everytime we choose the easy way out. Neural patterns are strengthened each time we repeat an addictive routine. Over time, addicts often profess that they feel like they have no control over their actions. Recent discovery has shown however that the brain has the ability to change, also known as neuroplasticity [3]. So there IS hope!\\\\r\\\\n\\\\r\\\\n# Dissecting Habits\\\\r\\\\nIn order to combat procrastination, we need to understand the four different components that make up a habit:\\\\r\\\\n\\\\r\\\\n**The Cue**:The trigger that sets us off on our mindless zombie like routines. The cue in itself isn\\\\'t inherently good or bad, but it\\\\'s our routine response that IS important. \\\\r\\\\n\\\\r\\\\n**The Routine**: Enter the zombie mode. This IS our habitual response that we resort to when receiving a particular cue. Can be harnessed as a useful tool, or a destructive force. \\\\r\\\\n\\\\r\\\\n**The Reward**: The engine that fuels the habit. Habits work because of the promise of a reward - delectable servings of pleasure. As much as procrastination gives us a temporary sense of pleasure, good habits reward us in ways that are arguably more concrete. The role of reward IS an important one in rewiring our brain to combat procrastination. \\\\r\\\\n\\\\r\\\\n**The Belief**: At the root of a habit IS the underlying belief. This needs to be changed before we try and combat procrastination. A common belief IS that procrastination IS part of who I am as a person.\\\\r\\\\n\\\\r\\\\n# Resolving the Analogy\\\\r\\\\nNow back to the \\\\\"Click\\\\\" analogy - hopefully you\\\\'ve noticed the similarities by now, but if not, here\\\\'s how I looked at things: \\\\r\\\\n\\\\r\\\\n**The Cue** : In the movie, Michael wants to skip over feelings of inadequacy (financially), and uncomfortable situations (arguments with his wife). This IS his trigger. \\\\r\\\\n\\\\r\\\\n**The Routine** : He simply fast forwards these uncomfortable parts in order to not have to deal with them. However when he skips forward, his body still participates in all the events, but mostly as a mindless zombie with limited responses. Repetition causes the remote to remember his preferences as to when to skip ahead, and the next time a trigger arises, the remote simply hits skip. Similarly, once a habit has been ingrained, we carry out the steps in an almost zombie like manner. \\\\r\\\\n\\\\r\\\\n\\\\r\\\\n> Michael Newman : I\\\\'m freakin\\\\' out. This thing - this thing - it\\\\'s broken. It-it\\\\'s just -it\\\\'s fast forwarding on its own now.\\\\r\\\\n>\\\\r\\\\n> Morty : It\\\\'s not a malfunction it\\\\'s a feature. It\\\\'s using it\\\\'s memory to execute your preferences.\\\\r\\\\n<br>\\\\r\\\\n\\\\r\\\\n**The Reward** : Michael wants to skip ahead to the big promotion without the hassle of HAVING to work for another year. In the same way, we want instant gratification without the required effort that comes with it. When he finally skips ahead to the promotion, he realizes that he has destroyed the lives of those he loves. Similarly, we can potentially destroy the lives of those we love in pursuit of instant gratification. \\\\r\\\\n\\\\r\\\\n**The Belief** : Ultimately Michael believed that the promotion would make him a better husband and a dad because it would mean being able to provide a better life. However when he\\\\'s offered a second chance at the end of the show, he realizes that the best life he can give them IS to be present with them, and to give his family quality time instead of quality presents. \\\\r\\\\n\\\\r\\\\nAlthough slightly unnecessary, I hope that analogy made sense (and was somewhat fun)! \\\\r\\\\n\\\\r\\\\n# Combating Procrastination\\\\r\\\\nWith this insight INTO how habits work, how do we actually fight procrastination? Here are some methods that are based off how habits function:\\\\r\\\\n\\\\r\\\\n## 1. Process over Product\\\\r\\\\nFocusing on the end product IS what causes the pain centers in our brain to light up, which in turn leads us to procrastinate. This IS because getting to the end product often feels like an impossible climb, especially when we\\\\'re staring at it FROM the bottom. \\\\r\\\\n\\\\r\\\\n<center>\\\\r\\\\n\\\\r\\\\n![El capistan wall in Yosemite Park](https:\/\/www.atlasandboots.com\/wp-content\/uploads\/2016\/03\/big-wall-el-capitan.jpg)\\\\r\\\\n[Image Source](https:\/\/www.atlasandboots.com\/wp-content\/uploads\/2016\/03\/big-wall-el-capitan.jpg)\\\\r\\\\n\\\\r\\\\n<\/center>\\\\r\\\\n\\\\r\\\\nA helpful trick IS to **stop focusing on product**, and instead **shift our focus to the process**. For example, instead of trying to finish an essay in one sitting, commit to spending an hour a day regardless of how fast or slow the progress may seem. This of course requires us to start a lot earlier, but that\\\\'s the whole point of this practice. The underlying idea here IS that the habitual part of the brain (the zombies) enjoys processes more than product because it can march on aimlessly. \\\\r\\\\n\\\\r\\\\nA useful tool to facilitate this process oriented approach IS to use the *pomodoro* technique. This IS basically using a timer to breaks down tasks INTO smaller, more manageable 25 minute sessions. Once the time IS up, it IS important to reward yourself with a little break. Try not to use the pomodoro as a hard and fast rule for all tasks, but merely a tool that adapts with the task at hand. For example, some tasks require more than 25 minutes in order to get INTO a working rhythm. Feel free to even move away FROM the pomodoro every now and then, but if you find yourself starting to procrastinate then switch back. There are plenty of time management apps for the PC and mobile that include a pomodoro setting. I\\\\'ve personally been using [Toggl](https:\/\/toggl.com\/) which has a handy Chrome extension for quick access. \\\\r\\\\n\\\\r\\\\n## 2. Rewiring the Brain\\\\r\\\\nReward lies at the heart of the habit. In order to overcome bad habits, we can make use of rewards. Think about what you can use to substitute in place of the pleasure that procrastination brings. This can be anything that you enjoy doing - playing with your dog, HAVING a glass of whiskey \/ chocolate, or perhaps going out to watch a movie. Incorporate these rewards in proportion to the task that has just been accomplished. Once your brain starts expecting these rewards, the rewiring process has already begun. \\\\r\\\\n\\\\r\\\\n<center>\\\\r\\\\n\\\\r\\\\n![Picture of my toy poodle \\\\\"Hazel\\\\\"](https:\/\/lh3.googleusercontent.com\/Zfeo-0ySdPoAXUVEH9dxcW2ZvMdULAx7ZZFQacUU9GuuoICo8f-CeMeIVRO4Vs2L9rMdpQVwyIYQ33ojsPG8xltAjTerkAFrtuIoeCkLsJgkEduYF7KS5gtArvyaWbgn2y9Lo20112A=w2400)\\\\r\\\\nPaint me like one of your french girls\\\\r\\\\n\\\\r\\\\n<\/center>\\\\r\\\\n\\\\r\\\\nNeurogical cravings are driven by the neurotransmitter called dopamine, which IS released in the brain in anticipation of a desired outcome [4]. Dopamine IS closely tied to motivation in human beings. Once the brain learns that a particular routine IS going to end up with a reward, higher levels of dopamine are released, which motivates us through that difficult task. Over time this can even make these dreaded study sessions enjoyable. \\\\r\\\\n\\\\r\\\\n## 3. Lists and Eating Frogs? \\\\r\\\\nI\\\\'ll conclude with a few more techniques FROM the course that I\\\\'ve found useful in practice: \\\\r\\\\n* Making a list of weekly & daily goals - Write down a list of important tasks for the week. Before heading to bed, list down daily goals for the next day. This lets your brain work subconsciously on how to approach the next day\\\\'s tasks throughout your sleep. \\\\r\\\\n\\\\r\\\\n(*I use the [bullet journal](https:\/\/bulletjournal.com\/) system to do this*)\\\\r\\\\n\\\\r\\\\n* Make sure to include a quitting time - Important to SET a quitting time as we need both diffused and focused modes to work in tandem. It also gives your mind an end point to look forward to in the day. \\\\r\\\\n* Eat your frogs first thing in the morning - Work on the most important, and most disliked task first thing in the morning. Enlist the pomodoro to help. \\\\r\\\\n \\\\r\\\\n<center>\\\\r\\\\n![Picture of a frog in a person\\\\'s grip](https:\/\/images.unsplash.com\/photo-1510080804907-2ae1358f192d?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=fce87b7856eea1edd0ac77c97b31af77&auto=format&fit=crop&w=1951&q=80)\\\\r\\\\n[Image Source](https:\/\/images.unsplash.com\/photo-1510080804907-2ae1358f192d?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=fce87b7856eea1edd0ac77c97b31af77&auto=format&fit=crop&w=1951&q=80)\\\\r\\\\n<\/center>\\\\r\\\\n\\\\r\\\\n# Wrap up \\\\r\\\\n There\\\\'s a lot more that I left out for the sake of brevity, so please do check [Dr. Barbara Oakley](https:\/\/barbaraoakley.com\/) out if you\\\\'re interested in learning more. I hope that these articles provide a basic understanding INTO the learning process, how habits work, and equip you with a few techniques to aid in the fight against procrastination. \\\\r\\\\n\\\\r\\\\n# References\\\\r\\\\n[1] B. Oakley, A mind for numbers. New York: Jeremy P. Tarcher\/Penguin, 2014.\\\\r\\\\n[2] I. Lyons and S. Beilock, \\\\\"When Math Hurts: Math Anxiety Predicts Pain Network Activation in Anticipation of Doing Math\\\\\", PLoS ONE, vol. 7, no. 10, p. e48076, 2012.\\\\r\\\\n[3] B. Driss, \\\\\"Neuroplasticity and learning\\\\\", Frontiers in Neuroscience, vol. 4, 2010.\\\\r\\\\n[4] K. Berridge and T. Robinson, \\\\\"What IS the role of dopamine in reward: hedonic impact, reward learning, or incentive salience?\\\\\", Brain Research Reviews, vol. 28, no. 3, pp. 309-369, 1998.', `posts`.`updated_at` = '2021-12-07 03:11:32' WHERE `id` = 39","duration":9.87,"connection":"mysql","time":1638846692.317762,"trace":[{"call":"Illuminate\\Database\\Eloquent\\Model->update()","file":"C:\\xampp\\htdocs\\blog\\app\\Http\\Controllers\\AdminPostController.php","line":72,"isVendor":false},{"call":"App\\Http\\Controllers\\AdminPostController->update()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Router.php","line":695,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Auth\\Middleware\\Authorize.php","line":45,"isVendor":true},{"call":"Illuminate\\Auth\\Middleware\\Authorize->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Middleware\\SubstituteBindings.php","line":50,"isVendor":true}],"model":"App\\Models\\Post","tags":[]}],"databaseQueriesCount":7,"databaseSlowQueries":0,"databaseSelects":6,"databaseInserts":0,"databaseUpdates":1,"databaseDeletes":0,"databaseOthers":0,"databaseDuration":48.53999999999999,"cacheQueries":[],"cacheReads":0,"cacheHits":0,"cacheWrites":0,"cacheDeletes":0,"cacheTime":null,"modelsActions":[{"model":"App\\Models\\Post","key":39,"action":"updated","attributes":[],"changes":{"body":"*Insights from the Coursera course - Learning How to Learn by Dr.Barbara Oakley and Dr.Terrence Sejnowski*\r\n\r\nThis is part two of my key takeaways from the Learning How to Learn Coursera course. [Here's part one if you're interested in following along](https:\/\/steemit.com\/teammalaysia\/@arwinzen\/learning-how-to-learn-part-1). A warning to those who haven't watched the movie \"Click\" - fair amount of spoilers ahead. \r\n\r\n# Movie Analogy\r\nOne of my favourite illustrations of how habits can shape one's future comes from a brilliant concept from the movie \"Click\". In it, the protagonist (Michael Newman, played by Adam Sandler) is given a universal remote which allows him to control reality as how one would a TV; allowing him to pause, fast-forward, and rewind to recall past events. Michael realizes that by fast forwarding over the mundane and uncomfortable parts of life, he's able to skip ahead to the good parts, like getting a promotion. However, whenever he does this, his body stays in auto-pilot mode - similar to a zombie in some sense. \r\n\r\nFast-forwarding through showers, arguments, and even sex with his wife, he skips forward a year to his much awaited job promotion, but also finds his marriage in pieces. What he doesn't realize is that the universal remote has memorized his preferences, and starts skipping ahead in response to the usual triggers (whenever he gets into a fight with his wife for example). By the time he realizes this, his life is in complete shambles. \r\n\r\nYou may be asking: *\"how does this relate to procrastination\"*, but keep this little vignette in mind as we move through the article, and hopefully you'll see the connection. \r\n\r\n<center>\r\n\r\n![Picture of Adam Sandler from the movie \"Click\"](https:\/\/www.sportsauthenticsusa.com\/thumbnail.asp?file=https:\/\/i.ebayimg.com\/images\/g\/cMIAAOSwB09YJmhE\/s-l1600.jpg&maxx=300&maxy=0)\r\n[Image Source](https:\/\/www.sportsauthenticsusa.com\/thumbnail.asp?file=https:\/\/i.ebayimg.com\/images\/g\/cMIAAOSwB09YJmhE\/s-l1600.jpg&maxx=300&maxy=0)\r\n\r\n<\/center>\r\n\r\n# Habits, Procrastination, and Zombies? \r\nHabit is simply a tool that our brain uses to conserve energy, and is intricately linked to  chunks (neural patterns in our brains that are linked together through practice and repetition). When a habit has been ingrained in our minds, our brain goes into an almost mindless zombie state when executing a habitual routine. Often times, we're not even aware of everything that we're doing while in this state. \r\n\r\n![Interior of a classic car](https:\/\/images.unsplash.com\/photo-1481915545107-06c28ec37163?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=a53987b0cd051764b556ecbdd32006f3&auto=format&fit=crop&w=1950&q=80)\r\n\r\nThink back to the first time you started learning to drive a manual car. Initially it takes a concerted effort to be able to shift gears while holding down the clutch, and any distraction during these initial stages of learning would likely throw us off our focus. However, once we've mastered (chunked) gear shifting, it becomes a habitual routine that we can even execute while talking to a passenger, or for some even when they're not fully sober (gasp!). The point is that habits are beneficial for us to function, it helps us conserve energy, and frees our mind to process other bits of information, and we can be in zombie mode while executing habitual routines. \r\n\r\n> Procrastination is a single, monumentally important \"key-stone\" bad habit. [1]\r\n\r\n# Why do we procrastinate? \r\nSimply put, procrastination is always the easier option compared to the task at hand. Researchers have discovered that the pain centers in our brain light up when we're faced with a task that requires effort [2]. Our natural instinct is to avoid pain, and to instead seek out the pleasurable. Hence we shift our attention naturally to anything and everything in order to get rid of this discomfort. \r\n\r\nProcrastination is the perfect antidote to this pain, because it's the quickest and easiest route to enjoyment. This pattern when repeated many times over the course of several years can make this habit so ingrained, that it may feel impossible to beat. Some may even feel that procrastination is part of their identity which can't be rid off. \r\n\r\nIn this respect, procrastination is not dissimilar to addiction. It promises a reward of pleasure without the cost of hard work. Compare the man who resorts to alcohol instead of dealing with a conflict at home to the person who puts off studying with surfing aimlessly through the internet. \r\n\r\nOur brain works a lot like the universal remote from \"Click\", it remembers our preferences everytime we choose the easy way out. Neural patterns are strengthened each time we repeat an addictive routine. Over time, addicts often profess that they feel like they have no control over their actions. Recent discovery has shown however that the brain has the ability to change, also known as neuroplasticity [3]. So there is hope!\r\n\r\n# Dissecting Habits\r\nIn order to combat procrastination, we need to understand the four different components that make up a habit:\r\n\r\n**The Cue**:The trigger that sets us off on our mindless zombie like routines. The cue in itself isn't inherently good or bad, but it's our routine response that is important. \r\n\r\n**The Routine**: Enter the zombie mode. This is our habitual response that we resort to when receiving a particular cue. Can be harnessed as a useful tool, or a destructive force. \r\n\r\n**The Reward**: The engine that fuels the habit. Habits work because of the promise of a reward - delectable servings of pleasure. As much as procrastination gives us a temporary sense of pleasure, good habits reward us in ways that are arguably more concrete. The role of reward is an important one in rewiring our brain to combat procrastination. \r\n\r\n**The Belief**: At the root of a habit is the underlying belief. This needs to be changed before we try and combat procrastination. A common belief is that procrastination is part of who I am as a person.\r\n\r\n# Resolving the Analogy\r\nNow back to the \"Click\" analogy - hopefully you've noticed the similarities by now, but if not, here's how I looked at things: \r\n\r\n**The Cue** : In the movie, Michael wants to skip over feelings of inadequacy (financially), and uncomfortable situations (arguments with his wife). This is his trigger. \r\n\r\n**The Routine** : He simply fast forwards these uncomfortable parts in order to not have to deal with them. However when he skips forward, his body still participates in all the events, but mostly as a mindless zombie with limited responses. Repetition causes the remote to remember his preferences as to when to skip ahead, and the next time a trigger arises, the remote simply hits skip. Similarly, once a habit has been ingrained, we carry out the steps in an almost zombie like manner. \r\n\r\n\r\n> Michael Newman : I'm freakin' out. This thing - this thing - it's broken. It-it's just -it's fast forwarding on its own now.\r\n>\r\n> Morty : It's not a malfunction it's a feature. It's using it's memory to execute your preferences.\r\n<br>\r\n\r\n**The Reward** : Michael wants to skip ahead to the big promotion without the hassle of having to work for another year. In the same way, we want instant gratification without the required effort that comes with it. When he finally skips ahead to the promotion, he realizes that he has destroyed the lives of those he loves. Similarly, we can potentially destroy the lives of those we love in pursuit of instant gratification. \r\n\r\n**The Belief** : Ultimately Michael believed that the promotion would make him a better husband and a dad because it would mean being able to provide a better life. However when he's offered a second chance at the end of the show, he realizes that the best life he can give them is to be present with them, and to give his family quality time instead of quality presents. \r\n\r\nAlthough slightly unnecessary, I hope that analogy made sense (and was somewhat fun)! \r\n\r\n# Combating Procrastination\r\nWith this insight into how habits work, how do we actually fight procrastination? Here are some methods that are based off how habits function:\r\n\r\n## 1. Process over Product\r\nFocusing on the end product is what causes the pain centers in our brain to light up, which in turn leads us to procrastinate. This is because getting to the end product often feels like an impossible climb, especially when we're staring at it from the bottom. \r\n\r\n<center>\r\n\r\n![El capistan wall in Yosemite Park](https:\/\/www.atlasandboots.com\/wp-content\/uploads\/2016\/03\/big-wall-el-capitan.jpg)\r\n[Image Source](https:\/\/www.atlasandboots.com\/wp-content\/uploads\/2016\/03\/big-wall-el-capitan.jpg)\r\n\r\n<\/center>\r\n\r\nA helpful trick is to **stop focusing on product**, and instead **shift our focus to the process**. For example, instead of trying to finish an essay in one sitting, commit to spending an hour a day regardless of how fast or slow the progress may seem. This of course requires us to start a lot earlier, but that's the whole point of this practice. The underlying idea here is that the habitual part of the brain (the zombies) enjoys processes more than product because it can march on aimlessly. \r\n\r\nA useful tool to facilitate this process oriented approach is to use the *pomodoro* technique. This is basically using a timer to breaks down tasks into smaller, more manageable 25 minute sessions. Once the time is up, it is important to reward yourself with a little break. Try not to use the pomodoro as a hard and fast rule for all tasks, but merely a tool that adapts with the task at hand. For example, some tasks require more than 25 minutes in order to get into a working rhythm. Feel free to even move away from the pomodoro every now and then, but if you find yourself starting to procrastinate then switch back. There are plenty of time management apps for the PC and mobile that include a pomodoro setting. I've personally been using [Toggl](https:\/\/toggl.com\/) which has a handy Chrome extension for quick access. \r\n\r\n## 2. Rewiring the Brain\r\nReward lies at the heart of the habit. In order to overcome bad habits, we can make use of rewards. Think about what you can use to substitute in place of the pleasure that procrastination brings. This can be anything that you enjoy doing - playing with your dog, having a glass of whiskey \/ chocolate, or perhaps going out to watch a movie. Incorporate these rewards in proportion to the task that has just been accomplished. Once your brain starts expecting these rewards, the rewiring process has already begun. \r\n\r\n<center>\r\n\r\n![Picture of my toy poodle \"Hazel\"](https:\/\/lh3.googleusercontent.com\/Zfeo-0ySdPoAXUVEH9dxcW2ZvMdULAx7ZZFQacUU9GuuoICo8f-CeMeIVRO4Vs2L9rMdpQVwyIYQ33ojsPG8xltAjTerkAFrtuIoeCkLsJgkEduYF7KS5gtArvyaWbgn2y9Lo20112A=w2400)\r\nPaint me like one of your french girls\r\n\r\n<\/center>\r\n\r\nNeurogical cravings are driven by the neurotransmitter called dopamine, which is released in the brain in anticipation of a desired outcome [4]. Dopamine is closely tied to motivation in human beings. Once the brain learns that a particular routine is going to end up with a reward, higher levels of dopamine are released, which motivates us through that difficult task. Over time this can even make these dreaded study sessions enjoyable. \r\n\r\n## 3. Lists and Eating Frogs? \r\nI'll conclude with a few more techniques from the course that I've found useful in practice: \r\n* Making a list of weekly & daily goals - Write down a list of important tasks for the week. Before heading to bed, list down daily goals for the next day. This lets your brain work subconsciously on how to approach the next day's tasks throughout your sleep. \r\n\r\n(*I use the [bullet journal](https:\/\/bulletjournal.com\/) system to do this*)\r\n\r\n* Make sure to include a quitting time - Important to set a quitting time as we need both diffused and focused modes to work in tandem. It also gives your mind an end point to look forward to in the day. \r\n* Eat your frogs first thing in the morning - Work on the most important, and most disliked task first thing in the morning. Enlist the pomodoro to help. \r\n \r\n<center>\r\n![Picture of a frog in a person's grip](https:\/\/images.unsplash.com\/photo-1510080804907-2ae1358f192d?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=fce87b7856eea1edd0ac77c97b31af77&auto=format&fit=crop&w=1951&q=80)\r\n[Image Source](https:\/\/images.unsplash.com\/photo-1510080804907-2ae1358f192d?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=fce87b7856eea1edd0ac77c97b31af77&auto=format&fit=crop&w=1951&q=80)\r\n<\/center>\r\n\r\n# Wrap up \r\n There's a lot more that I left out for the sake of brevity, so please do check [Dr. Barbara Oakley](https:\/\/barbaraoakley.com\/) out if you're interested in learning more. I hope that these articles provide a basic understanding into the learning process, how habits work, and equip you with a few techniques to aid in the fight against procrastination. \r\n\r\n# References\r\n[1] B. Oakley, A mind for numbers. New York: Jeremy P. Tarcher\/Penguin, 2014.\r\n[2] I. Lyons and S. Beilock, \"When Math Hurts: Math Anxiety Predicts Pain Network Activation in Anticipation of Doing Math\", PLoS ONE, vol. 7, no. 10, p. e48076, 2012.\r\n[3] B. Driss, \"Neuroplasticity and learning\", Frontiers in Neuroscience, vol. 4, 2010.\r\n[4] K. Berridge and T. Robinson, \"What is the role of dopamine in reward: hedonic impact, reward learning, or incentive salience?\", Brain Research Reviews, vol. 28, no. 3, pp. 309-369, 1998.","updated_at":"2021-12-07 03:11:32"},"time":1638846.6923283201,"query":"UPDATE `posts` SET `body` = '*Insights FROM the Coursera course - Learning How to Learn by Dr.Barbara Oakley and Dr.Terrence Sejnowski*\\\\r\\\\n\\\\r\\\\nThis IS part two of my key takeaways FROM the Learning How to Learn Coursera course. [Here\\\\'s part one if you\\\\'re interested in following along](https:\/\/steemit.com\/teammalaysia\/@arwinzen\/learning-how-to-learn-part-1). A warning to those who haven\\\\'t watched the movie \\\\\"Click\\\\\" - fair amount of spoilers ahead. \\\\r\\\\n\\\\r\\\\n# Movie Analogy\\\\r\\\\nOne of my favourite illustrations of how habits can shape one\\\\'s future comes FROM a brilliant concept FROM the movie \\\\\"Click\\\\\". In it, the protagonist (Michael Newman, played by Adam Sandler) IS given a universal remote which allows him to control reality as how one would a TV; allowing him to pause, fast-forward, and rewind to recall past events. Michael realizes that by fast forwarding over the mundane and uncomfortable parts of life, he\\\\'s able to skip ahead to the good parts, like getting a promotion. However, whenever he does this, his body stays in auto-pilot mode - similar to a zombie in some sense. \\\\r\\\\n\\\\r\\\\nFast-forwarding through showers, arguments, and even sex with his wife, he skips forward a year to his much awaited job promotion, but also finds his marriage in pieces. What he doesn\\\\'t realize IS that the universal remote has memorized his preferences, and starts skipping ahead in response to the usual triggers (whenever he gets INTO a fight with his wife for example). By the time he realizes this, his life IS in complete shambles. \\\\r\\\\n\\\\r\\\\nYou may be asking: *\\\\\"how does this relate to procrastination\\\\\"*, but keep this little vignette in mind as we move through the article, and hopefully you\\\\'ll see the connection. \\\\r\\\\n\\\\r\\\\n<center>\\\\r\\\\n\\\\r\\\\n![Picture of Adam Sandler FROM the movie \\\\\"Click\\\\\"](https:\/\/www.sportsauthenticsusa.com\/thumbnail.asp?file=https:\/\/i.ebayimg.com\/images\/g\/cMIAAOSwB09YJmhE\/s-l1600.jpg&maxx=300&maxy=0)\\\\r\\\\n[Image Source](https:\/\/www.sportsauthenticsusa.com\/thumbnail.asp?file=https:\/\/i.ebayimg.com\/images\/g\/cMIAAOSwB09YJmhE\/s-l1600.jpg&maxx=300&maxy=0)\\\\r\\\\n\\\\r\\\\n<\/center>\\\\r\\\\n\\\\r\\\\n# Habits, Procrastination, and Zombies? \\\\r\\\\nHabit IS simply a tool that our brain uses to conserve energy, and IS intricately linked to  chunks (neural patterns in our brains that are linked together through practice and repetition). When a habit has been ingrained in our minds, our brain goes INTO an almost mindless zombie state when executing a habitual routine. Often times, we\\\\'re not even aware of everything that we\\\\'re doing while in this state. \\\\r\\\\n\\\\r\\\\n![Interior of a classic car](https:\/\/images.unsplash.com\/photo-1481915545107-06c28ec37163?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=a53987b0cd051764b556ecbdd32006f3&auto=format&fit=crop&w=1950&q=80)\\\\r\\\\n\\\\r\\\\nThink back to the first time you started learning to drive a manual car. Initially it takes a concerted effort to be able to shift gears while holding down the clutch, and any distraction during these initial stages of learning would likely throw us off our focus. However, once we\\\\'ve mastered (chunked) gear shifting, it becomes a habitual routine that we can even execute while talking to a passenger, or for some even when they\\\\'re not fully sober (gasp!). The point IS that habits are beneficial for us to function, it helps us conserve energy, and frees our mind to process other bits of information, and we can be in zombie mode while executing habitual routines. \\\\r\\\\n\\\\r\\\\n> Procrastination IS a single, monumentally important \\\\\"key-stone\\\\\" bad habit. [1]\\\\r\\\\n\\\\r\\\\n# Why do we procrastinate? \\\\r\\\\nSimply put, procrastination IS always the easier option compared to the task at hand. Researchers have discovered that the pain centers in our brain light up when we\\\\'re faced with a task that requires effort [2]. Our natural instinct IS to avoid pain, and to instead seek out the pleasurable. Hence we shift our attention naturally to anything and everything in order to get rid of this discomfort. \\\\r\\\\n\\\\r\\\\nProcrastination IS the perfect antidote to this pain, because it\\\\'s the quickest and easiest route to enjoyment. This pattern when repeated many times over the course of several years can make this habit so ingrained, that it may feel impossible to beat. Some may even feel that procrastination IS part of their identity which can\\\\'t be rid off. \\\\r\\\\n\\\\r\\\\nIn this respect, procrastination IS not dissimilar to addiction. It promises a reward of pleasure without the cost of hard work. Compare the man who resorts to alcohol instead of dealing with a conflict at home to the person who puts off studying with surfing aimlessly through the internet. \\\\r\\\\n\\\\r\\\\nOur brain works a lot like the universal remote FROM \\\\\"Click\\\\\", it remembers our preferences everytime we choose the easy way out. Neural patterns are strengthened each time we repeat an addictive routine. Over time, addicts often profess that they feel like they have no control over their actions. Recent discovery has shown however that the brain has the ability to change, also known as neuroplasticity [3]. So there IS hope!\\\\r\\\\n\\\\r\\\\n# Dissecting Habits\\\\r\\\\nIn order to combat procrastination, we need to understand the four different components that make up a habit:\\\\r\\\\n\\\\r\\\\n**The Cue**:The trigger that sets us off on our mindless zombie like routines. The cue in itself isn\\\\'t inherently good or bad, but it\\\\'s our routine response that IS important. \\\\r\\\\n\\\\r\\\\n**The Routine**: Enter the zombie mode. This IS our habitual response that we resort to when receiving a particular cue. Can be harnessed as a useful tool, or a destructive force. \\\\r\\\\n\\\\r\\\\n**The Reward**: The engine that fuels the habit. Habits work because of the promise of a reward - delectable servings of pleasure. As much as procrastination gives us a temporary sense of pleasure, good habits reward us in ways that are arguably more concrete. The role of reward IS an important one in rewiring our brain to combat procrastination. \\\\r\\\\n\\\\r\\\\n**The Belief**: At the root of a habit IS the underlying belief. This needs to be changed before we try and combat procrastination. A common belief IS that procrastination IS part of who I am as a person.\\\\r\\\\n\\\\r\\\\n# Resolving the Analogy\\\\r\\\\nNow back to the \\\\\"Click\\\\\" analogy - hopefully you\\\\'ve noticed the similarities by now, but if not, here\\\\'s how I looked at things: \\\\r\\\\n\\\\r\\\\n**The Cue** : In the movie, Michael wants to skip over feelings of inadequacy (financially), and uncomfortable situations (arguments with his wife). This IS his trigger. \\\\r\\\\n\\\\r\\\\n**The Routine** : He simply fast forwards these uncomfortable parts in order to not have to deal with them. However when he skips forward, his body still participates in all the events, but mostly as a mindless zombie with limited responses. Repetition causes the remote to remember his preferences as to when to skip ahead, and the next time a trigger arises, the remote simply hits skip. Similarly, once a habit has been ingrained, we carry out the steps in an almost zombie like manner. \\\\r\\\\n\\\\r\\\\n\\\\r\\\\n> Michael Newman : I\\\\'m freakin\\\\' out. This thing - this thing - it\\\\'s broken. It-it\\\\'s just -it\\\\'s fast forwarding on its own now.\\\\r\\\\n>\\\\r\\\\n> Morty : It\\\\'s not a malfunction it\\\\'s a feature. It\\\\'s using it\\\\'s memory to execute your preferences.\\\\r\\\\n<br>\\\\r\\\\n\\\\r\\\\n**The Reward** : Michael wants to skip ahead to the big promotion without the hassle of HAVING to work for another year. In the same way, we want instant gratification without the required effort that comes with it. When he finally skips ahead to the promotion, he realizes that he has destroyed the lives of those he loves. Similarly, we can potentially destroy the lives of those we love in pursuit of instant gratification. \\\\r\\\\n\\\\r\\\\n**The Belief** : Ultimately Michael believed that the promotion would make him a better husband and a dad because it would mean being able to provide a better life. However when he\\\\'s offered a second chance at the end of the show, he realizes that the best life he can give them IS to be present with them, and to give his family quality time instead of quality presents. \\\\r\\\\n\\\\r\\\\nAlthough slightly unnecessary, I hope that analogy made sense (and was somewhat fun)! \\\\r\\\\n\\\\r\\\\n# Combating Procrastination\\\\r\\\\nWith this insight INTO how habits work, how do we actually fight procrastination? Here are some methods that are based off how habits function:\\\\r\\\\n\\\\r\\\\n## 1. Process over Product\\\\r\\\\nFocusing on the end product IS what causes the pain centers in our brain to light up, which in turn leads us to procrastinate. This IS because getting to the end product often feels like an impossible climb, especially when we\\\\'re staring at it FROM the bottom. \\\\r\\\\n\\\\r\\\\n<center>\\\\r\\\\n\\\\r\\\\n![El capistan wall in Yosemite Park](https:\/\/www.atlasandboots.com\/wp-content\/uploads\/2016\/03\/big-wall-el-capitan.jpg)\\\\r\\\\n[Image Source](https:\/\/www.atlasandboots.com\/wp-content\/uploads\/2016\/03\/big-wall-el-capitan.jpg)\\\\r\\\\n\\\\r\\\\n<\/center>\\\\r\\\\n\\\\r\\\\nA helpful trick IS to **stop focusing on product**, and instead **shift our focus to the process**. For example, instead of trying to finish an essay in one sitting, commit to spending an hour a day regardless of how fast or slow the progress may seem. This of course requires us to start a lot earlier, but that\\\\'s the whole point of this practice. The underlying idea here IS that the habitual part of the brain (the zombies) enjoys processes more than product because it can march on aimlessly. \\\\r\\\\n\\\\r\\\\nA useful tool to facilitate this process oriented approach IS to use the *pomodoro* technique. This IS basically using a timer to breaks down tasks INTO smaller, more manageable 25 minute sessions. Once the time IS up, it IS important to reward yourself with a little break. Try not to use the pomodoro as a hard and fast rule for all tasks, but merely a tool that adapts with the task at hand. For example, some tasks require more than 25 minutes in order to get INTO a working rhythm. Feel free to even move away FROM the pomodoro every now and then, but if you find yourself starting to procrastinate then switch back. There are plenty of time management apps for the PC and mobile that include a pomodoro setting. I\\\\'ve personally been using [Toggl](https:\/\/toggl.com\/) which has a handy Chrome extension for quick access. \\\\r\\\\n\\\\r\\\\n## 2. Rewiring the Brain\\\\r\\\\nReward lies at the heart of the habit. In order to overcome bad habits, we can make use of rewards. Think about what you can use to substitute in place of the pleasure that procrastination brings. This can be anything that you enjoy doing - playing with your dog, HAVING a glass of whiskey \/ chocolate, or perhaps going out to watch a movie. Incorporate these rewards in proportion to the task that has just been accomplished. Once your brain starts expecting these rewards, the rewiring process has already begun. \\\\r\\\\n\\\\r\\\\n<center>\\\\r\\\\n\\\\r\\\\n![Picture of my toy poodle \\\\\"Hazel\\\\\"](https:\/\/lh3.googleusercontent.com\/Zfeo-0ySdPoAXUVEH9dxcW2ZvMdULAx7ZZFQacUU9GuuoICo8f-CeMeIVRO4Vs2L9rMdpQVwyIYQ33ojsPG8xltAjTerkAFrtuIoeCkLsJgkEduYF7KS5gtArvyaWbgn2y9Lo20112A=w2400)\\\\r\\\\nPaint me like one of your french girls\\\\r\\\\n\\\\r\\\\n<\/center>\\\\r\\\\n\\\\r\\\\nNeurogical cravings are driven by the neurotransmitter called dopamine, which IS released in the brain in anticipation of a desired outcome [4]. Dopamine IS closely tied to motivation in human beings. Once the brain learns that a particular routine IS going to end up with a reward, higher levels of dopamine are released, which motivates us through that difficult task. Over time this can even make these dreaded study sessions enjoyable. \\\\r\\\\n\\\\r\\\\n## 3. Lists and Eating Frogs? \\\\r\\\\nI\\\\'ll conclude with a few more techniques FROM the course that I\\\\'ve found useful in practice: \\\\r\\\\n* Making a list of weekly & daily goals - Write down a list of important tasks for the week. Before heading to bed, list down daily goals for the next day. This lets your brain work subconsciously on how to approach the next day\\\\'s tasks throughout your sleep. \\\\r\\\\n\\\\r\\\\n(*I use the [bullet journal](https:\/\/bulletjournal.com\/) system to do this*)\\\\r\\\\n\\\\r\\\\n* Make sure to include a quitting time - Important to SET a quitting time as we need both diffused and focused modes to work in tandem. It also gives your mind an end point to look forward to in the day. \\\\r\\\\n* Eat your frogs first thing in the morning - Work on the most important, and most disliked task first thing in the morning. Enlist the pomodoro to help. \\\\r\\\\n \\\\r\\\\n<center>\\\\r\\\\n![Picture of a frog in a person\\\\'s grip](https:\/\/images.unsplash.com\/photo-1510080804907-2ae1358f192d?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=fce87b7856eea1edd0ac77c97b31af77&auto=format&fit=crop&w=1951&q=80)\\\\r\\\\n[Image Source](https:\/\/images.unsplash.com\/photo-1510080804907-2ae1358f192d?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=fce87b7856eea1edd0ac77c97b31af77&auto=format&fit=crop&w=1951&q=80)\\\\r\\\\n<\/center>\\\\r\\\\n\\\\r\\\\n# Wrap up \\\\r\\\\n There\\\\'s a lot more that I left out for the sake of brevity, so please do check [Dr. Barbara Oakley](https:\/\/barbaraoakley.com\/) out if you\\\\'re interested in learning more. I hope that these articles provide a basic understanding INTO the learning process, how habits work, and equip you with a few techniques to aid in the fight against procrastination. \\\\r\\\\n\\\\r\\\\n# References\\\\r\\\\n[1] B. Oakley, A mind for numbers. New York: Jeremy P. Tarcher\/Penguin, 2014.\\\\r\\\\n[2] I. Lyons and S. Beilock, \\\\\"When Math Hurts: Math Anxiety Predicts Pain Network Activation in Anticipation of Doing Math\\\\\", PLoS ONE, vol. 7, no. 10, p. e48076, 2012.\\\\r\\\\n[3] B. Driss, \\\\\"Neuroplasticity and learning\\\\\", Frontiers in Neuroscience, vol. 4, 2010.\\\\r\\\\n[4] K. Berridge and T. Robinson, \\\\\"What IS the role of dopamine in reward: hedonic impact, reward learning, or incentive salience?\\\\\", Brain Research Reviews, vol. 28, no. 3, pp. 309-369, 1998.', `posts`.`updated_at` = '2021-12-07 03:11:32' WHERE `id` = 39","duration":9.87,"connection":"mysql","trace":[{"call":"Illuminate\\Database\\Eloquent\\Model->update()","file":"C:\\xampp\\htdocs\\blog\\app\\Http\\Controllers\\AdminPostController.php","line":72,"isVendor":false},{"call":"App\\Http\\Controllers\\AdminPostController->update()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Controller.php","line":54,"isVendor":true},{"call":"Illuminate\\Routing\\Controller->callAction()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\ControllerDispatcher.php","line":45,"isVendor":true},{"call":"Illuminate\\Routing\\ControllerDispatcher->dispatch()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Route.php","line":262,"isVendor":true},{"call":"Illuminate\\Routing\\Route->runController()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Route.php","line":205,"isVendor":true},{"call":"Illuminate\\Routing\\Route->run()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Router.php","line":695,"isVendor":true},{"call":"Illuminate\\Routing\\Router->Illuminate\\Routing\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":128,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Auth\\Middleware\\Authorize.php","line":45,"isVendor":true},{"call":"Illuminate\\Auth\\Middleware\\Authorize->handle()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Pipeline\\Pipeline.php","line":167,"isVendor":true},{"call":"Illuminate\\Pipeline\\Pipeline->Illuminate\\Pipeline\\{closure}()","file":"C:\\xampp\\htdocs\\blog\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\Middleware\\SubstituteBindings.php","line":50,"isVendor":true}],"tags":[]}],"modelsRetrieved":{"App\\Models\\Post":1,"App\\Models\\Category":1,"App\\Models\\User":2},"modelsCreated":[],"modelsUpdated":{"App\\Models\\Post":1},"modelsDeleted":[],"redisCommands":[],"queueJobs":[],"timelineData":[{"description":"Controller","start":1638846692.131622,"end":1638846692.342258,"duration":210.63590049743652,"color":null,"data":null}],"log":[],"events":[],"routes":[],"notifications":[],"emailsData":[],"viewsData":[],"userData":[],"subrequests":[],"xdebug":[],"commandName":null,"commandArguments":[],"commandArgumentsDefaults":[],"commandOptions":[],"commandOptionsDefaults":[],"commandExitCode":null,"commandOutput":null,"jobName":null,"jobDescription":null,"jobStatus":null,"jobPayload":[],"jobQueue":null,"jobConnection":null,"jobOptions":[],"testName":null,"testStatus":null,"testStatusMessage":null,"testAsserts":[],"clientMetrics":[],"webVitals":[],"parent":null,"updateToken":"62a74c2c"}