blog/app/Http/Controllers/AdminPostController.php

SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 50 offset 0
SELECT count(*) as aggregate FROM `posts`
---
    public function index(){
        return view('admin.posts.index', [
           'posts' => Post::latest()->paginate(50)
        ]);

UPDATE `posts` SET `body` = '# this IS the heading\\r\\n## heading 2\\r\\n\\r\\n**BOLD TEXT HERE**\\r\\n\\r\\nOrdered list:\\r\\n\\r\\n1. one\\r\\n2. two\\r\\n3. three\\r\\n\\r\\n> Block quote', `posts`.`updated_at` = '2021-12-02 08:12:39' WHERE `id` = 37
---
    public function update(Post $post){
        // validate input fields for update of post
        $attributes = request()->validate([
            'title' => 'required',
            'thumbnail' => 'image',
            'slug' => ['required', Rule::unique('posts','slug')->ignore($post->id)],
            'excerpt' => 'required',
            'body' => 'required',
            // make sure that category_id provided exists in the database
            'category_id' => ['required', Rule::exists('categories', 'id')]
        ]);

        //
        if( isset($attributes['thumbnail'])){
            $attributes['thumbnail'] = request()->file('thumbnail')->store('thumbnails');
        }
//        $attributes['thumbnail'] = request()->file('thumbnail')->store('thumbnails');

        // update post
        $post->update($attributes);