blog/app/Http/Controllers/ApiPostController.php

    public function index(){
        return Post::latest()->exclude(['body'])->paginate(5);
---
SELECT count(*) as aggregate FROM `posts`