blog/app/Http/Controllers/PostCommentsController.php

    public function store(Post $post){
        // validate inputs
        request()->validate([
            'body' => 'required'
        ]);

        // add a comment to the given post
        $post->comments()->create([
//           'user_id' => auth()->id(),
            'user_id' => request()->user()->id,
            'body' => request('body')
        ]);
---
INSERT INTO `comments` (`user_id`, `body`, `post_id`, `updated_at`, `created_at`) VALUES (48, 'Hey, this author looks familiar!!', 42, '2021-12-01 05:47:10', '2021-12-01 05:47:10')