blog/app/Http/Controllers/PostController.php

SELECT * FROM `categories` WHERE `categories`.`id` in (2)
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 6 offset 0
SELECT count(*) as aggregate FROM `posts`
---
    public function index() {
        return view('posts.index', [
            'posts' => Post::latest()->filter(
                request(['search', 'category','author'])
            )->paginate(6)->withQueryString()
        ]);