blog/app/Http/Controllers/RegisterController.php

    public function store(){
        // create the user
//        return (request()->all());
        $attributes = request()->validate([
            'name' => ['required', 'min: 3', 'max:255', ],
//            'username' => ['required', 'min:3', 'max:255', 'unique:users,username'],
            // alternatively can be written
            'username' => ['required', 'min:3', 'max:255', Rule::unique('users', 'username')],
            'email' => ['required', 'email', 'max:255', Rule::unique('users', 'email')],
            'password' => ['required', 'min:7', 'max:255']
        ]);

        // password is hashed in the user model under an eloquent mutator
//        $attributes['password'] = bcrypt($attributes['password']);

        $user = User::create($attributes);
---
INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('amal', 'amalamal', 'amal@genius.com', '$2y$10$72QmYahNcdXzrmUoAon06uSjHmllVrjZKALzhpVr10ozk.SczPsxq', '2021-12-01 09:46:09', '2021-12-01 09:46:09')